In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv(r"C:\Users\sanja\Downloads\Data-cleaning-for-beginners-using-pandas.csv")

In [3]:
df.head()

   Index   Age     Salary  Rating       Location  Established Easy Apply
0      0  44.0  $44k-$99k     5.4       India,In         1999       TRUE
1      1  66.0  $55k-$66k     3.5    New York,Ny         2002       TRUE
2      2   NaN  $77k-$89k    -1.0    New York,Ny           -1         -1
3      3  64.0  $44k-$99k     4.4       India In         1988         -1
4      4  25.0  $44k-$99k     6.4  Australia Aus         2002         -1

**Missing Value**

In [4]:
df.isnull().sum()

Index          0
Age            7
Salary         0
Rating         1
Location       0
Established    0
Easy Apply     0
dtype: int64

As we can see, Age and Rating columns contain missing value. The total size of the dataset is 29x7, also the missing value is low in number, we can perform either of the following steps
    1. Remove the entire row that contains the missing value.
    2. Replacing the missing values by median or mode value of the column.
    we can observe from the above table information rating columns as only one missing values we quiet go with removing the row from the dataset, whereas if we do the same action the on Age column we could lose some row in the small dataset, so we can opt for the 2 action to deal missing values.

In [5]:
missing_values_index = df[df['Rating'].isnull()].index
df = df.drop(missing_values_index)

In [6]:
df['Age'].fillna(df['Age'].mode()[0], inplace=True)

In [7]:
df.isnull().sum()

Index          0
Age            0
Salary         0
Rating         0
Location       0
Established    0
Easy Apply     0
dtype: int64

In [8]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
Index: 28 entries, 0 to 28
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Index        28 non-null     int64
 1   Age          28 non-null     float64
 2   Salary       28 non-null     object
 3   Rating       28 non-null     float64
 4   Location     28 non-null     object
 5   Established  28 non-null     int64
 6   Easy Apply   28 non-null     object
dtypes: float64(2), int64(2), object(3)
memory usage: 1.8+ KB
None

 **Salary Formatting**

In [9]:
def avg_salary(salary):
    if '-' in salary:
        low, high = salary.split('-')
        return (float(low)+float(high))/2
    else:
        return float(salary)

In [10]:
# Conversion Salary Formatting:

df['Salary'] = df['Salary'].apply(lambda x:x.replace("$",''))
df['Salary'] = df['Salary'].apply(lambda x:x.replace("k",'000'))

df['Salary'] = df['Salary'].apply(avg_salary)
df

    Index   Age   Salary  Rating       Location  Established Easy Apply
0       0  44.0  71500.0     5.4       India,In         1999       TRUE
1       1  66.0  60500.0     3.5    New York,Ny         2002       TRUE
2       2  44.0  83000.0    -1.0    New York,Ny           -1         -1
3       3  64.0  71500.0     4.4       India In         1988         -1
4       4  25.0  71500.0     6.4  Australia Aus         2002         -1
5       5  44.0  83000.0     1.4       India,In         1999       TRUE
6       6  21.0  71500.0     0.0    New York,Ny           -1         -1
7       7  44.0  71500.0    -1.0  Australia Aus           -1         -1
8       8  35.0  71500.0     5.4    New York,Ny           -1         -1
9       9  22.0  71500.0     7.7       India,In           -1       TRUE
10     10  55.0  29500.0     5.4       India,In         2008       TRUE
11     11  44.0  29500.0     6.7       India,In         2009         -1
12     12  44.0  71500.0     0.0       India,In         1999         -1
13     13  25.0  71500.0    -1.0  Australia Aus         2019       TRUE
14     14  66.0  71500.0     4.0  Australia Aus         2020       TRUE
15     15  44.0  94500.0     3.0  Australia Aus         1999         -1
16     16  19.0  29500.0     4.5       India,In         1984         -1
17     17  44.0  71500.0     5.3    New York,Ny         1943       TRUE
18     18  35.0  71500.0     6.7    New York,Ny         1954       TRUE
19     19  32.0  71500.0     3.3    New York,Ny         1955       TRUE
20     20  44.0  71500.0     5.7    New York,Ny         1944       TRUE
21     21  35.0  71500.0     5.0    New York,Ny         1946         -1
22     22  19.0  60500.0     7.8    New York,Ny         1988       TRUE
23     23  44.0  71500.0     2.4    New York,Ny         1999       TRUE
24     24  13.0  71500.0    -1.0    New York,Ny         1987         -1
25     25  55.0  71500.0     0.0  Australia Aus         1980       TRUE
27     27  52.0  71500.0     5.4       India,In         1935         -1
28     28  44.0  63500.0     3.4  Australia Aus         1932         -1

**Easy Apply Indicator**

In [11]:
#converting -1 value to False 
df['Easy Apply'] = df['Easy Apply'].apply(lambda x:x.replace("-1",'False'))

Converting the - 1 value into False, and I'm just considering it as an object only

**Outlier Finding in Numerical Columns**

In [12]:
Q1_age = df['Age'].quantile(0.25)
print(Q1_age)
Q3_age = df['Age'].quantile(0.75)
print(Q3_age)
IQR_age = Q3_age - Q1_age
print(IQR_age)
outliers_age = df[(df['Age'] < (Q1_age - 1.5 * IQR_age)) | (df['Age'] > (Q3_age + 1.5 * IQR_age))]

outliers_age

30.25
44.0
13.75

    Index   Age   Salary  Rating       Location  Established Easy Apply
1       1  66.0  60500.0     3.5    New York,Ny         2002       TRUE
14     14  66.0  71500.0     4.0  Australia Aus         2020       TRUE

In [13]:
Q1_salary = df['Salary'].quantile(0.25)
Q3_salary = df['Salary'].quantile(0.75)
IQR_salary = Q3_salary - Q1_salary

outliers_salary = df[(df['Salary'] < (Q1_salary - 1.5 * IQR_salary)) | (df['Salary'] > (Q3_salary + 1.5 * IQR_salary))]
print(Q1_salary - 1.5 * IQR_salary)
outliers_salary

71500.0

    Index   Age   Salary  Rating       Location  Established Easy Apply
1       1  66.0  60500.0     3.5    New York,Ny         2002       TRUE
2       2  44.0  83000.0    -1.0    New York,Ny           -1      False
5       5  44.0  83000.0     1.4       India,In         1999       TRUE
10     10  55.0  29500.0     5.4       India,In         2008       TRUE
11     11  44.0  29500.0     6.7       India,In         2009      False
15     15  44.0  94500.0     3.0  Australia Aus         1999      False
16     16  19.0  29500.0     4.5       India,In         1984      False
22     22  19.0  60500.0     7.8    New York,Ny         1988       TRUE
28     28  44.0  63500.0     3.4  Australia Aus         1932      False

In [14]:
Q1_rating = df['Rating'].quantile(0.25)
Q3_rating = df['Rating'].quantile(0.75)
IQR_rating = Q3_rating - Q1_rating
outliers_rating = df[(df['Rating'] < (Q1_rating - 1.5 * IQR_rating)) | (df['Rating'] > (Q3_rating + 1.5 * IQR_rating))]
print(Q1_rating - 1.5 * IQR_rating)
print(Q3_rating + 1.5 * IQR_rating)
outliers_rating

-5.4750000000000005
11.925

Empty DataFrame
Columns: [Index, Age, Salary, Rating, Location, Established, Easy Apply]
Index: []

Adjusting Outlier for Salary since total 10 rows comes under salary, we can't remove every row, or we can't leave as it is, so let's adjust the value by using sip() function.

In [15]:
df['Salary'] = df['Salary'].clip(lower=(Q1_salary - 1.5 * IQR_salary), upper=(Q3_salary + 1.5 * IQR_salary))

**Handling Special Characters**

In [16]:
df['Location'].value_counts()

Location
New York,Ny      12
India,In          8
Australia Aus     7
India In          1
Name: count, dtype: int64

In [17]:
df['Location']=df['Location'].replace('Australia Aus', 'Australia,Aus')
df['Location']=df['Location'].replace('India In', 'India,In')
df['Location'].value_counts()

Location
New York,Ny      12
India,In          9
Australia,Aus     7
Name: count, dtype: int64

In [18]:
df['Country'] = df['Location'].str.split(",",expand=False).str[0]

In [19]:
df

,Index,Age,Salary,Rating,Location,Established,Easy Apply,Country
0,0,44.0,71500.0,5.4,"India,In",1999,TRUE,India
1,1,66.0,71500.0,3.5,"New York,Ny",2002,TRUE,New York
2,2,44.0,71500.0,-1.0,"New York,Ny",-1,False,New York
3,3,64.0,71500.0,4.4,"India,In",1988,False,India
4,4,25.0,71500.0,6.4,"Australia,Aus",2002,False,Australia
5,5,44.0,71500.0,1.4,"India,In",1999,TRUE,India
6,6,21.0,71500.0,0.0,"New York,Ny",-1,False,New York
7,7,44.0,71500.0,-1.0,"Australia,Aus",-1,False,Australia
8,8,35.0,71500.0,5.4,"New York,Ny",-1,False,New York
9,9,22.0,71500.0,7.7,"India,In",-1,TRUE,India
10,10,55.0,71500.0,5.4,"India,In",2008,TRUE,India
11,11,44.0,71500.0,6.7,"India,In",2009,False,India
12,12,44.0,71500.0,0.0,"India,In",1999,False,India
13,13,25.0,71500.0,-1.0,"Australia,Aus",2019,TRUE,Australia
14,14,66.0,71500.0,4.0,"Australia,Aus",2020,TRUE,Australia
15,15,44.0,71500.0,3.0,"Australia,Aus",1999,False,Australia
16,16,19.0,71500.0,4.5,"India,In",1984,False,India
17,17,44.0,71500.0,5.3,"New York,Ny",1943,TRUE,New York
18,18,35.0,71500.0,6.7,"New York,Ny",1954,TRUE,New York
19,19,32.0,71500.0,3.3,"New York,Ny",1955,TRUE,New York
20,20,44.0,71500.0,5.7,"New York,Ny",1944,TRUE,New York
21,21,35.0,71500.0,5.0,"New York,Ny",1946,False,New York
22,22,19.0,71500.0,7.8,"New York,Ny",1988,TRUE,New York
23,23,44.0,71500.0,2.4,"New York,Ny",1999,TRUE,New York
24,24,13.0,71500.0,-1.0,"New York,Ny",1987,False,New York
25,25,55.0,71500.0,0.0,"Australia,Aus",1980,TRUE,Australia
27,27,52.0,71500.0,5.4,"India,In",1935,False,India
28,28,44.0,71500.0,3.4,"Australia,Aus",1932,False,Australia

In [20]:
expected_min = 1
expected_max = 10

df['Rating'] = df['Rating'].apply(lambda x: x if expected_min < x < expected_max else pd.NA)

In [21]:
df['Established'] = df['Established'].apply(lambda x: x if x > -1 else pd.NA)

In [22]:
df

,Index,Age,Salary,Rating,Location,Established,Easy Apply,Country
0,0,44.0,71500.0,5.4,"India,In",1999,TRUE,India
1,1,66.0,71500.0,3.5,"New York,Ny",2002,TRUE,New York
2,2,44.0,71500.0,<NA>,"New York,Ny",<NA>,False,New York
3,3,64.0,71500.0,4.4,"India,In",1988,False,India
4,4,25.0,71500.0,6.4,"Australia,Aus",2002,False,Australia
5,5,44.0,71500.0,1.4,"India,In",1999,TRUE,India
6,6,21.0,71500.0,<NA>,"New York,Ny",<NA>,False,New York
7,7,44.0,71500.0,<NA>,"Australia,Aus",<NA>,False,Australia
8,8,35.0,71500.0,5.4,"New York,Ny",<NA>,False,New York
9,9,22.0,71500.0,7.7,"India,In",<NA>,TRUE,India
10,10,55.0,71500.0,5.4,"India,In",2008,TRUE,India
11,11,44.0,71500.0,6.7,"India,In",2009,False,India
12,12,44.0,71500.0,<NA>,"India,In",1999,False,India
13,13,25.0,71500.0,<NA>,"Australia,Aus",2019,TRUE,Australia
14,14,66.0,71500.0,4.0,"Australia,Aus",2020,TRUE,Australia
15,15,44.0,71500.0,3.0,"Australia,Aus",1999,False,Australia
16,16,19.0,71500.0,4.5,"India,In",1984,False,India
17,17,44.0,71500.0,5.3,"New York,Ny",1943,TRUE,New York
18,18,35.0,71500.0,6.7,"New York,Ny",1954,TRUE,New York
19,19,32.0,71500.0,3.3,"New York,Ny",1955,TRUE,New York
20,20,44.0,71500.0,5.7,"New York,Ny",1944,TRUE,New York
21,21,35.0,71500.0,5.0,"New York,Ny",1946,False,New York
22,22,19.0,71500.0,7.8,"New York,Ny",1988,TRUE,New York
23,23,44.0,71500.0,2.4,"New York,Ny",1999,TRUE,New York
24,24,13.0,71500.0,<NA>,"New York,Ny",1987,False,New York
25,25,55.0,71500.0,<NA>,"Australia,Aus",1980,TRUE,Australia
27,27,52.0,71500.0,5.4,"India,In",1935,False,India
28,28,44.0,71500.0,3.4,"Australia,Aus",1932,False,Australia

In [23]:
''' From the above table we can see the Age of people list. when we are calculating outlier people at age 66 years seem to be outliers whereas Age 13 is quit unusual so we can remove it.'''

' From the above table we can see the Age of people list. when we are calculating outlier people at age 66 years seem to be outliers whereas Age 13 is quit unusual so we can remove it.'

In [24]:
df = df.drop(df[df['Age']==13.0].index)

In [25]:
df['Easy Apply'].dtype

dtype('O')

In [26]:
df['Easy Apply']=df['Easy Apply'].astype(bool)